{
	"Home": {
		"title": "Bienvenido a NotJira",
		"Toast": "Texto copiado al portapapeles",
		"Tab1": "Para empezar",
		"Tab2": "Arquitectura",
		"Tab3": "Más detalles",
		"Overview": "Introducción",
		"OverviewContent": "El objetivo de este proyecto es desarrollar una aplicación que satisfaga los requisitos especificados en el documento PDF proporcionado. Dado que no se incluía una descripción detallada de cómo debía ser la aplicación, opté por crear una versión clon de Jira Software de Atlassian. Este enfoque se eligió debido a las múltiples funcionalidades que ofrece Jira y que se alinean estrechamente con las funcionalidades requeridas en el documento.",
		"Installation": "Instalación",
		"InstallationContent": "El proyecto se encuentra alojado en GitHub y se puede clonar con el siguiente comando:",
		"Dependencies": "Dependencias",
		"DependenciesContent": "Para descargar las dependencias necesarias, ejecute el siguiente comando en la raíz del proyecto:",
		"Environment": "Configuración de entorno",
		"EnvironmentContent": "El proyecto requiere de un archivo .env en la raíz del proyecto con las siguientes variables de entorno:",
		"Bulk": "Carga de datos",
		"BulkContent": "La aplicación incluye un script en la ruta /scripts/bulk-insert.ts que permite cargar datos de prueba en la base de datos. Puede ejecutar el script con el siguiente comando:",
		"Run": "Ejecución",
		"RunContent": "Finalmente, para ejecutar la aplicación en modo desarrollo, ejecute el siguiente comando:",
		"Support": "Soporte",
		"SupportContent": "Si encuentra algún problema o tiene alguna pregunta, no dude en abrir un issue en el repositorio de GitHub. En caso de que desee contactarme o ver proyectos similares, puede visitar mi sitio web.",
		"GithubButton": "Ver en GitHub",
		"WebButton": "Visitar Sitio Web",
		"Explanation": "Explicación",
		"ExplanationContent": "Mi aplicación utiliza una arquitectura modular basada en componentes sobre Next.js y React. La elección de esta arquitectura está motivada por la necesidad de crear una aplicación escalable, mantenible y eficiente.",
		"Modules": "Módulos",
		"ModulesContent": "La aplicación está dividida en módulos definidos, lo que facilita la organización del código y la colaboración entre equipos. Cada módulo tiene una responsabilidad específica. Los principales módulos son:",
		"AppRouter": "App Router",
		"AppRouterContent": "El enrutador de la aplicación se basa en Next.js y App Router, esto permite la creación de rutas a partir de archivos y directorios, junto al middleware se puede proteger las rutas de la aplicación. Esto lo podrás ver con más detalle en ",
		"ContextAndProviders": "Context y Providers",
		"ContextAndProvidersContent": "El contexto y los proveedores son fundamentales para la aplicación, ya que permiten compartir información entre componentes sin necesidad de pasar props manualmente. Un caso particular en este desarrollo es i18nt.ts que se encarga de manejar las traducciones de la aplicación, no está envuelto en context por seguir la configuración por defecto de Next.js. Más detalles en",
		"Components": "Componentes",
		"ComponentsContent": "Los componentes son la base de la aplicación, se encuentran en la carpeta ",
		"ComponentsContent2": " y son reutilizables. Estos componentes son utilizados en diferentes partes de la aplicación y se dividen en dos, los componentes de UI y los componentes de lógica.",
		"Domain": "Dominio",
		"DomainContent": "El dominio de la aplicación se encuentra en la carpeta ",
		"DomainContent2": " y contiene los modelos de la aplicación. Estos modelos son utilizados para la creación de los documentos en la base de datos y la validación de los mismos. Son fundamentales para la integridad de los datos.",
		"Lib": "Librerías",
		"LibContent": "La carpeta ",
		"LibContent2": " contiene las librerías que son utilizadas en la aplicación, como por ejemplo las funciones de utilidad y las funciones de conexión a la base de datos.",
		"Layout": "Layout",
		"LayoutContent": "El layout de la aplicación se encuentra en la carpeta ",
		"LayoutContent2": " y contiene los componentes que definen la estructura de la aplicación. Estos componentes son utilizados en diferentes partes de la aplicación y permiten mantener la consistencia visual. Otro ejemplo se encuentra en la carpeta ",
		"LayoutContent3": ", este layaout usa NavLink para tener una navegación más rápida y eficiente en el sideBar de la aplicación."

	},
	"Dashboard": {
		"Home": "Inicio",
		"Projects": "Proyectos",
		"Teams": "Equipos",
		"Settings": "Configuración",
		"Logout": "Cerrar sesión",
		"Greetings": "Hola,"
	},
	"Projects": {
		"Title": "Obtén NotJira Premium",
		"Subtitle": "Más estadísticas, gráficos y analíticas para",
		"SubtitleColorVariant": "tus proyectos",
		"Feature1": "Amplia gama de",
		"Feature1ColorVariant": "herramientas de gestión de proyectos",
		"Feature2": "Avanzado",
		"Feature2ColorVariant": "análisis y estadísticas",
		"Feature3": "Más",
		"Feature3ColorVariant": "opciones de personalización",
		"Premium": "Actualiza Ahora",
		"OnProjects": "Proyectos Activos",
		"EndProjects": "Proyectos Terminados",
		"Marketing": "Marketing",
		"Development": "Desarrollo",
		"Design": "Diseño",
		"Operations": "Soporte",
		"Pcr": "Tasa de finalización de proyectos",
		"Pcompleted": "Proyectos Completados",
		"Pongoing": "Proyectos en curso"
	},
	"Teams": {
		"Title": "Equipos",
		"FirstName": "Nombre",
		"LastName": "Apellido",
		"Team": "Equipo",
		"Role": "Rol",
		"OnProjects": "Proyectos en curso",
		"EndProjects": "Proyectos completados"
	},
	"Settings": {
		"Accessibility": "Accesibilidad",
		"AccessibilityDescription": "¿Necesitas ayuda? Consulta las características de WCAG.",
		"ComingSoon": "Próximamente...",
		"CustomizeTheme": "Personaliza el tema",
		"CustomizeThemeDescription": "Elige entre claro, oscuro o abyss.",
		"Customize": "Personalizar",
		"SelectLanguage": "Selecciona un idioma",
		"SelectLanguageDescription": "Disponible en 5 idiomas.",
		"Select": "Seleccionar",
		"RestartWorkspace": "Reiniciar espacio de trabajo",
		"RestartWorkspaceDescription": "Borra todos tus datos, configuraciones y comienza de nuevo.",
		"Restart": "Reiniciar",
		"Notifications": "Notificaciones",
		"NotificationsDescription": "Gestiona la posición y el estilo de tus notificaciones.",
		"Manage": "Gestionar",
		"Lang": "Selecciona un idioma",
		"Theme": "Cambiar tema",
		"LightDescription": "El modo light es el tema predeterminado.",
		"DarkDescription": "El modo oscuro es agradable a la vista.",
		"AbyssDescription": "Para aquellos que aman el rosa.",
		"Spanish": "Español",
		"English": "Inglés",
		"French": "Francés",
		"Italian": "Italiano",
		"Japanese": "Japonés",
		"Notification": "Ajustes de notificaciones",
		"Topleft": "Arriba a la izquierda",
		"Topright": "Arriba a la derecha",
		"Bottomleft": "Abajo a la izquierda",
		"Bottomright": "Abajo a la derecha",
		"Position": "La posición ha sido cambiada y guardada"
	}
}
