{
	"Home": {
		"title": "Bienvenue sur NotJira",
		"Toast": "Texte copié dans le presse-papiers",
		"Tab1": "Pour commencer",
		"Tab2": "Architecture",
		"Tab3": "Plus de détails",
		"Overview": "Introduction",
		"OverviewContent": "L'objectif de ce projet est de développer une application qui répond aux exigences spécifiées dans le document PDF fourni. Comme une description détaillée de l'application n'était pas incluse, j'ai choisi de créer une version clone du Jira Software d'Atlassian. Cette approche a été choisie en raison des nombreuses fonctionnalités offertes par Jira, qui sont étroitement alignées avec les fonctionnalités requises dans le document.",
		"Installation": "Installation",
		"InstallationContent": "Le projet est hébergé sur GitHub et peut être cloné avec la commande suivante :",
		"Dependencies": "Dépendances",
		"DependenciesContent": "Pour télécharger les dépendances nécessaires, exécutez la commande suivante à la racine du projet :",
		"Environment": "Configuration de l'environnement",
		"EnvironmentContent": "Le projet nécessite un fichier .env à la racine du projet avec les variables d'environnement suivantes :",
		"Bulk": "Importation de données",
		"BulkContent": "L'application comprend un script dans /scripts/bulk-insert.ts qui permet de charger des données de test dans la base de données. Vous pouvez exécuter le script avec la commande suivante :",
		"Run": "Exécution",
		"RunContent": "Enfin, pour exécuter l'application en mode développement, exécutez la commande suivante :",
		"Support": "Support",
		"SupportContent": "Si vous rencontrez des problèmes ou avez des questions, n'hésitez pas à ouvrir un problème sur le dépôt GitHub. Si vous souhaitez me contacter ou voir des projets similaires, vous pouvez visiter mon site web.",
		"GithubButton": "Voir sur GitHub",
		"WebButton": "Visiter le site web",
		"Explanation": "Explication",
		"ExplanationContent": "Mon application utilise une architecture modulaire basée sur des composants avec Next.js et React. Cette architecture a été choisie en raison du besoin de créer une application évolutive, maintenable et efficace.",
		"Modules": "Modules",
		"ModulesContent": "L'application est divisée en modules définis, ce qui facilite l'organisation du code et la collaboration entre les équipes. Chaque module a une responsabilité spécifique. Les principaux modules sont :",
		"AppRouter": "App Router",
		"AppRouterContent": "Le routeur de l'application est basé sur Next.js et App Router, ce qui permet la création de routes à partir de fichiers et de répertoires. Avec le middleware, vous pouvez protéger les routes de l'application. Vous verrez plus de détails dans ",
		"ContextAndProviders": "Contexte et Providers",
		"ContextAndProvidersContent": "Le contexte et les fournisseurs sont essentiels pour l'application car ils permettent de partager des informations entre les composants sans avoir à passer les props manuellement. Un cas particulier dans ce développement est i18nt.ts, qui gère les traductions de l'application et n'est pas enveloppé dans le contexte pour suivre la configuration par défaut de Next.js. Plus de détails dans ",
		"Components": "Composants",
		"ComponentsContent": "Les composants sont la base de l'application et se trouvent dans le dossier ",
		"ComponentsContent2": " et sont réutilisables. Ces composants sont utilisés dans différentes parties de l'application et se divisent en composants UI et composants de logique.",
		"Domain": "Domaine",
		"DomainContent": " Le domaine de l'application se trouve dans le dossier ",
		"DomainContent2": " et contient les modèles de l'application. Ces modèles sont utilisés pour créer des documents dans la base de données et les valider. Ils sont essentiels pour l'intégrité des données.",
		"Lib": "Bibliothèques",
		"LibContent": "Le dossier ",
		"LibContent2": " contient les bibliothèques utilisées dans l'application, telles que les fonctions utilitaires et les fonctions de connexion à la base de données.",
		"Layout": "Mise en page",
		"LayoutContent": "La mise en page de l'application se trouve dans le dossier ",
		"LayoutContent2": " et contient les composants qui définissent la structure de l'application. Ces composants sont utilisés dans différentes parties de l'application et aident à maintenir la cohérence visuelle. Un autre exemple se trouve dans le dossier ",
		"LayoutContent3": ", cette mise en page utilise NavLink pour une navigation plus rapide et plus efficace dans la barre latérale de l'application.",
		"DependenciesTabDetailsContent": "Pour le développement de cette application, les dépendances suivantes organisées par catégories ont été utilisées :",
		"CategoryOne": "Base de données, authentification et Fetching",
		"CategoryTwo": "Bibliothèques et Outils de Conception",
		"CategoryThree": "Frameworks de Test",
		"Themes": "Thèmes et théorie des couleurs",
		"ThemesContent": "Il y a 3 thèmes dans l'application : un thème par défaut et deux supplémentaires. Les couleurs de l'application suivent la théorie des couleurs et la psychologie des couleurs. Je me suis appuyé sur divers outils pour la sélection des couleurs, tels qu'Adobe Color et Coolors.",
		"Branding": "Branding et typographie",
		"BrandingContent": "Le branding de l'application a été réalisé avec Logo.com et Canva. Une marque a été créée avec les couleurs choisies préalablement et une typographie similaire à celle de Jira. Vous pouvez trouver la marque complète dans un fichier .zip situé dans le dossier /public."
	},
	"Dashboard": {
		"Home": "Accueil",
		"Projects": "Projets",
		"Teams": "Équipes",
		"Settings": "Paramètres",
		"Logout": "Déconnexion",
		"Greetings": "Bonjour,"
	},
	"Projects": {
		"Title": "Découvrez la magie de NotJira",
		"Subtitle": "Plus de statistiques, graphiques et analyses pour",
		"SubtitleColorVariant": "vos projets",
		"Feature1": "Large gamme de",
		"Feature1ColorVariant": "outils de gestion de projet",
		"Feature2": "Avancé",
		"Feature2ColorVariant": "analyses et insights",
		"Feature3": "Plus",
		"Feature3ColorVariant": "d'options de personnalisation",
		"Premium": "Mise à Jour Maintenant",
		"OnProjects": "Projets Actifs",
		"EndProjects": "Projets Terminés",
		"Marketing": "Marketing",
		"Development": "Développement",
		"Design": "Design",
		"Operations": "Opérations",
		"Pcr": "Taux de réalisation des projets",
		"Pcompleted": "Projets Terminés",
		"Pongoing": "Projets en cours"
	},
	"Teams": {
		"Title": "Équipes",
		"FirstName": "Prénom",
		"LastName": "Nom de famille",
		"Team": "Équipe",
		"Role": "Rôle",
		"OnProjects": "Projets en cours",
		"EndProjects": "Projets terminés"
	},
	"Settings": {
		"Accessibility": "Accessibilité",
		"AccessibilityDescription": "Besoin d'aide? Consultez les fonctionnalités WCAG.",
		"ComingSoon": "Bientôt disponible...",
		"CustomizeTheme": "Personnaliser le thème",
		"CustomizeThemeDescription": "Choisissez entre clair, sombre ou abyss.",
		"Customize": "Personnaliser",
		"SelectLanguage": "Sélectionnez une langue",
		"SelectLanguageDescription": "Disponible en 5 langues.",
		"Select": "Sélectionner",
		"RestartWorkspace": "Redémarrer l'espace de travail",
		"RestartWorkspaceDescription": "Effacez toutes vos données, paramètres et recommencez.",
		"Restart": "Redémarrer",
		"Notifications": "Notifications",
		"NotificationsDescription": "Gérez la position et le style de vos notifications.",
		"Manage": "Gérer",
		"Lang": "Sélectionnez une langue",
		"Theme": "Changer de thème",
		"LightDescription": "Le mode clair est le thème par défaut.",
		"DarkDescription": "Le mode sombre est agréable pour les yeux.",
		"AbyssDescription": "Pour ceux qui aiment le rose.",
		"Spanish": "Espagnol",
		"English": "Anglais",
		"French": "Français",
		"Italian": "Italien",
		"Japanese": "Japonais",
		"Notification": "Gérer les notifications",
		"Topleft": "Enhautàgauche",
		"Topright": "Enhautàdroite",
		"Bottomleft": "Enbasàgauche",
		"Bottomright": "Enbasàdroite",
		"Position": "La position a été changée et enregistrée"
	}
}